icavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-1 -1 -1.0)
    (1 -1 -1.0)
    (1  1 -1.0)
    (-1  1 -1.0)
    (-1 -1 41.0)
    (1 -1 41.0)
    (1  1 41.0)
    (-1  1 41.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 100 ) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    fixedWalls
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
