icavity/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cylinder;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {  
         name cylinder;
	}    
   }

 {
        name    bottom_patch_negative;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {  
         box (-0.5 -0.5 0.01) (0.5 0.5 41);
	}    
  }
 
{
        name    top_patch_negative;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {  
          box (-0.5 -0.5 -1.0) (0.5 0.5 39.99);
	}    



}


//new face set no:1

{
        name    bottomPatch;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {  
         set cylinder;
	}    
   }

{
        name    bottomPatch;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {  
         set  bottom_patch_negative;
	}    
   }

//new face set no:2

{
        name    topPatch;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {  
         set cylinder;
	}    
   }

{
        name    topPatch;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {  
         set  top_patch_negative;
	}    
   }

//new face set no:3

{
        name    wall;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {  
         set cylinder;
	}    
   }

{
        name    wall;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {  
         set  bottomPatch;
	}    
   }


   {
        name    wall;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {  
         set  topPatch;
	}    
   }



);

// ************************************************************************* //
